export default class NewsService {

    news = [
        {
            id: 1,
            article: 'Мировой ущерб от отключения интернета оценили в $8 миллиардов в год',
            image: '/images/new_1.jpg',
            shortDescription: 'Ущерб для мировой экономики от преднамеренных отключений интернета, в основном правительствами разных стран, достиг $8,05 млрд в 2019 году',
            fullNewsText: 'Ущерб для мировой экономики от преднамеренных отключений интернета, в основном правительствами разных стран, достиг $8,05 млрд в 2019 году.\n' +
            'Такие подсчеты опубликовала компания Top10VPN, передает БизнесЦензор со ссылкой на Коммерсант.\n' +
            '\n' +
            'По оценке компании, стоимость отключений интернета для мировой экономики выросла на 235% с 2016 года.\n' +
            '\n' +
            '2019 год оказался рекордным по числу таких отключений - количество масштабных отключений интернета (для всей страны или крупных регионов) достигло 122, а их длительность в общей сложности превысила 18 тыс. часов. По оценке авторов доклада, в большинстве случаев отключения происходили "в ответ на протесты и массовые беспорядки, особенно вокруг выборов, так как авторитарные режимы стремятся ограничить поток информации и удержать власть".\n' +
            '\n' +
            'В общей сложности подобные отключения интернета имели место в прошлом году в 21 стране. Лидером по цене таких отключений стал Ирак - его экономике это стоило $2,3 млрд, далее следуют Судан ($1,9 млрд), Индия ($1,3 млрд), Венесуэла ($1,1 млрд) и Иран ($611 млрд). Среди регионов на первом месте находятся Ближний Восток и Северная Африка ($3,1 млрд), за ними следуют Африка к югу от Сахары ($2,2 млрд) и Азия ($1,7 млрд). Притом дольше всего интернет отключали именно в Азии - в общей сложности на 9,7 тыс. часов - и в Африке к югу от Сахары (7,8 тыс. часов), длительность отключения на Ближнем Востоке составляет лишь 577 часов.\n' +
            '\n' +
            'Помимо собственно отключений интернета в докладе рассматривается и блокировка соцсетей и мессенджеров. Здесь лидером стал WhatsApp - его блокировали на 6,23 тыс. часов, далее идут Facebook (6,2 тыс. часов) и Instagram (6,19 тыс. часов).Источник: https://biz.censor.net.ua/n3168843'
        },
        {
            id: 2,
            article: 'Новая технология безопасных двигателей обещает показать высокую эффективность',
            image: '/images/new_2.jpg',
            shortDescription: 'Специалисты из Университета Ватерло сумели разработать более энергоэффективный и рациональный тип технологии, направленной',
            fullNewsText: 'Специалисты из Университета Ватерло сумели разработать более энергоэффективный и рациональный тип технологии, направленной на улучшение работы двигателя внутреннего сгорания – таким образом, их технология увеличивает его эффективность на 10%. Данная технология разрабатывалась специалистами на протяжении последних десяти лет и судя по предварительным результатам, обладает весьма высокой степенью надежности, так что ее можно применять в самых различных видах транспортной техники – от личных электромобилей до специального морского транспорта.\n' +
            '\n' +
            'Сама по себе эта новая технология представляет собой систему автоматического управления клапанами – как выпускными, так и впускными, при этом система может быть настроена до мелочей, что позволяет потенциальному автовладельцу очень точно настроить эффективность и экологичность двигателя внутреннего сгорания. Традиционно управление клапанами в автомобиле обеспечивается кулачными механизмами, однако специалисты из Ватерло решили применить вместо них комплексную систему гидравлических цилиндров и вращающихся клапанов, которые позволяют в точности определить тайминги переключения скорости и крутящего момента.'
        },
        {
            id: 3,
            article: 'Почти 11 млн биткоинов не перемещались со своих адресов за последний год',
                image: '/images/new_3.jpg',
            shortDescription: 'За последние 12 с лишним месяцев около 10,7 биткоинов неподвижно лежали на своих адресах',
            fullNewsText: 'За последние 12 с лишним месяцев около 10,7 биткоинов неподвижно лежали на своих адресах, что является наивысшим показателем с 2017 года. Об этом сообщает CoinDesk со ссылкой на данные аналитической компании Digital Assets Data.\n' +
        '\n' +
        'Это также означает, что из выпущенных к сегодняшнему дню 18,14 млн биткоинов в спящем режиме находилось почти 60%, в то время как в рыночных движениях участвовали оставшиеся 40%. По его словам, возможная причина в том, что многие инвесторы ожидают, что после майского халвинга цена биткоина существенно поднимется. В то же время Стадельман не исключает, что если эти ожидания не оправдаются, некоторые инвесторы захотят продать свои монеты.\n' +
        '\n' +
        'Исследователь Digital Assets Data Кевин Кальтенбахер также не исключает, что такое большое число неподвижных биткоинов обусловлено тем, что инвесторы могли приобрести их во время бычьего ралли в конце 2017 года, когда первая криптовалюта достигла исторического максимума в районе $20 000. Теперь они находятся в ожидании, что цены вернутся к прежним уровням и не спешат расставаться с своими биткоинами.\n' +
        '\n' +
        'Напомним, в прошлом месяце глава Digital Assets Data Райан Алфред заявил, что несмотря на существенное снижение цен по сравнению с отметками декабря 2017 года, наиболее капитализированные криптовалюты привлекательнее для инвесторов, чем традиционные активы вроде индексов Nasdaq и S&P, нефти или золота.',
        },
    ];

    user = {
        id: '12345',
        userName: 'Admin',
        pass: '12345',
        name: 'Уйлард Кэрролл',
        image: 'photo.jpg',
        birthDate: '25 сентября 1968 года',
        films: ['ABC Afterschool Specials', 'The Fresh Prince of Bel-Air', 'Where the Day Takes You', 'Made in America', 'Six Degrees of Separation', 'Bad Boys', 'Independence Day'],
        about: 'В Филадельфии Смит знакомится с музыкантом Джеффом Таунсом, с которым они в конце 1980-х годов получают широкую известность благодаря своему хип-хоп-дуэту DJ Jazzy Jeff & the Fresh Prince, ставший первым обладателем «Грэмми» за лучшее исполнение рэпа. Начиная с 1990 года исполнял главную роль в популярном телесериале «Принц из Беверли-Хиллз», где он, по сути, сыграл самого себя в юности. В эти ранние годы Уилл использовал сценический псевдоним Принц (из телесериала «Принц из Беверли-Хиллз»). Сериал имел огромный успех на протяжении шести лет (1990—1996).\n' +
            '\n' +
            'В середине 1990-х годов карьера Уилла Смита как кумира подростковой публики изживала себя, однако актёр смог вернуть себе популярность, исполнив главную роль в боевике «Плохие парни» (1995). Бюджет картины составил всего лишь 23 миллиона долларов, однако именно этот фильм вернул былую известность Уиллу Смиту и его партнеру Мартину Лоуренсу. Чуть позже Orange News признал Уилла Смита и Мартина Лоуренса лучшей экранной парой полицейских. За этим последовали такие блокбастеры как «День независимости» (1996), и «Люди в чёрном» (1997), музыкальная тема к которому в его исполнении возглавила британские чарты. В 1998 году на экраны вышел ещё один успешный боевик с участием Смита «Враг государства». В начале этого же года его композиция «Gettin\' Jiggy wit It (англ.)» (основанная на диско-хите Sister Sledge «He’s the Greatest Dancer») возглавила — Billboard Hot 100.'
    };

    checkUserData = (login, pass) => {
        return new Promise( (resolve, reject) => {
            setTimeout(() => {
                if (this.user.userName != login || this.user.pass != pass) {
                    reject(new Error('Вы ввели не верный логин или пароль'))
                }
                else {
                    resolve(true);
                }
            },2500)
        })
    };

    getUserInfo = () => {
        return new Promise( (resolve, reject) => {
            setTimeout(()=>{
                resolve({
                    name: this.user.name,
                    image: this.user.image,
                    birthDate: this.user.birthDate,
                    films: this.user.films,
                    about: this.user.about,
                })
            }, 2700)
        })
    };

    getNews = () => {
        return new Promise(resolve => {
            setTimeout(() => {
                resolve(this.news)
            }, 500)
        })
    }
}



